In [2]:
import pandas as pd

In [3]:
#Cargar el datset usando pandas
#Utilizamos una estructura nombrada DataFrame
df = pd.read_csv("tested.csv")

### Analisis Exploratorio ###
El primer paso posterior a la carga del dataset en un DataFrame de **Pandas**
Es realizar el *analisis exploratorio*
-Consiste en utilizar una serie de metodos de **Pandas** para obtener las caracteristicas del
dataset

In [5]:
#Desplegamos las caracteristicas del dataset
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [3]:
#Desplegar el nombre de las columnas del dataset
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
#Desplegar las primeras 5 filas del dataset
df.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]>

In [9]:
#Desplegar las ultimas 5 filas del dataset
df.tail

<bound method NDFrame.tail of      PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]>

In [10]:
#Desplegar la comfiguracion del dataset
df.shape

(418, 12)

In [11]:
#Conocer las estadisticas generales del dataset
df.describe

<bound method NDFrame.describe of      PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]>

### Analisis de Estadisticas Basicas del Dataset
- Utilizaremos comandos de Pandas para obtener algunas estadisticas basicas del dataset
- Por ejemplo las medidas de tendencia central: media, moda, desviacion estandar, identificar
datos faltantes.
-En esta fase inicia el proceso de limpieza de datos

In [12]:
# Iamagina que nos solicitan contar el numero de sobrevivientes del Titanica
# reportados por este dataset
print("Numero de sobrevivientes: {}".format(df["Survived"].value_counts()))

Numero de sobrevivientes: Survived
0    266
1    152
Name: count, dtype: int64

In [13]:
#Imagina que nos solicitan contar el numero de mujeres y hombres del Titanica
#Reportados por este dataset
print("Numero de mujeres y hombres: {}".format(df["Sex"].value_counts()))

Numero de mujeres y hombres: Sex
male      266
female    152
Name: count, dtype: int64

In [14]:
# Obtener la tripulacion categorizada por la clase
print("Por el tipo de clase: {}".format(df["Pclass"].value_counts()))

Por el tipo de clase: Pclass
3    218
1    107
2     93
Name: count, dtype: int64

In [15]:
# Determinar quienes eran mayores de edad del Titanic
# 21 aÃ±os
print("Numero de personas mayores de edad: {}".format(df[df["Age"]>=21].shape[0]))

Numero de personas mayores de edad: 263

In [16]:
# Determinar quienes eran mayores de edad del Titanic
# 21 aÃ±os
print("Numero de personas mayores de 30: {}".format(df[df["Age"]>=30].shape[0]))

Numero de personas mayores de 30: 147

In [17]:
ms = df[(df["Sex"]=="female") & (df["Survived"]==1)].shape[0]
porcentaje = (ms/df.shape[0])*100
print("Mujeres sobrevivientes del Titanic: {} y porcentaje: {:.2f}".format(ms, porcentaje))

Mujeres sobrevivientes del Titanic: 152 y porcentaje: 36.36

Well, in this activity, what I have learned or rather I am learning is to use datasets with a lot of information in such a way that I can or another person can know about the information of the dataset, for example knowing different data from the beginning or the end of the dataset by That's why we use functions like df.head() or df.tail(), or more complex problems like the ones I worked on in class, such as knowing how many men and women survived the fall of the Titanic, or also making programs that ask about the number of women or men of a certain age, or what class they belonged to at the time of the collapse of the Titanic or the total number of survivors or of women and men, but in short I had already handled datasets in the 5th semester in the subject of Machine Learning but it was in a way different from what I am doing in this matter, but I have had great progress as far as I am concerned in the management of the datasets, knowing how to be able to clean, analyze and manage the datasets better and I hope that in Professor Verduzco's classes I can improve my jupyter skills